devdnl/dnx-rtos/src/system/drivers/dma/drv/STM32F1F3/dma.c
/*==============================================================================
File     dma.c

Author   Daniel Zorychta

Brief    General usage DMA driver.

         Copyright (C) 2021 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


==============================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "dma/dma_ioctl.h"
#include "kernel/khooks.h"

#if defined(ARCH_stm32f1)
#include "stm32f1/stm32f10x.h"
#include "stm32f1/dma_ddi.h"
#elif defined(ARCH_stm32f3)
#include "stm32f3/stm32f3xx.h"
#include "stm32f3/dma_ddi.h"
#endif

/*==============================================================================
  Local macros
==============================================================================*/
#if defined(ARCH_stm32f1)
#define DMA_CCR_EN DMA_CCR1_EN
#define DMA_CCR_TCIE DMA_CCR1_TCIE
#define DMA_CCR_TEIE DMA_CCR1_TEIE
#define DMA_CCR_HTIE DMA_CCR1_HTIE
#elif defined(ARCH_stm32f3)
#endif

enum {
        _DMA1,
      #if defined(RCC_AHBENR_DMA2EN)
        _DMA2,
      #endif
        DMA_COUNT
};

#define DMA1_CHANNELS                   7
#define DMA2_CHANNELS                   5

#define DMAD(major, channel, ID)        (((ID) << 4) | (((channel) & 7) << 1) | ((major) & 1))
#define GETMAJOR(DMAD)                  (((DMAD) >> 0) & 1)
#define GETCHANNEL(DMAD)                (((DMAD) >> 1) & 7)

#define M2M_TRANSFER_TIMEOUT            5000

/*==============================================================================
  Local object types
==============================================================================*/
typedef struct {
        DMA_TypeDef          *DMA;
        DMA_Channel_TypeDef  *channel[max(DMA1_CHANNELS, DMA2_CHANNELS)];
        IRQn_Type             IRQn[max(DMA1_CHANNELS, DMA2_CHANNELS)];
        u8_t                  chcnt;
} DMA_HW_t;

typedef struct {
        void           *arg;
        _DMA_cb_t       cb_finish;
        _DMA_cb_t       cb_half;
        _DMA_cb_t       cb_next;
        u32_t           dmad;
        bool            release;
} DMA_RT_channel_t;

typedef struct {
        DMA_RT_channel_t   channel[max(DMA1_CHANNELS, DMA2_CHANNELS)];
        queue_t          **m2m_queue;
        u32_t              ID_ctr;
        u8_t               major;
} DMA_RT_t;

typedef struct {
        DMA_RT_t DMA[DMA_COUNT];
} DMA_mem_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static void clear_DMA_IRQ_flags(u8_t major, u8_t channel);
static bool M2M_callback(DMA_Channel_TypeDef *channel, u8_t SR, void *arg);

/*==============================================================================
  Local object
==============================================================================*/
MODULE_NAME(DMA);

static const DMA_HW_t DMA_HW[] = {
        {
                .DMA        = DMA1,
                .chcnt      = DMA1_CHANNELS,
                .channel[0] = DMA1_Channel1,
                .channel[1] = DMA1_Channel2,
                .channel[2] = DMA1_Channel3,
                .channel[3] = DMA1_Channel4,
                .channel[4] = DMA1_Channel5,
                .channel[5] = DMA1_Channel6,
                .channel[6] = DMA1_Channel7,
                .IRQn[0]    = DMA1_Channel1_IRQn,
                .IRQn[1]    = DMA1_Channel2_IRQn,
                .IRQn[2]    = DMA1_Channel3_IRQn,
                .IRQn[3]    = DMA1_Channel4_IRQn,
                .IRQn[4]    = DMA1_Channel5_IRQn,
                .IRQn[5]    = DMA1_Channel6_IRQn,
                .IRQn[6]    = DMA1_Channel7_IRQn,
        },
        #if defined(RCC_AHBENR_DMA2EN)
        {
                .DMA        = DMA2,
                .chcnt      = DMA2_CHANNELS,
                .channel[0] = DMA2_Channel1,
                .channel[1] = DMA2_Channel2,
                .channel[2] = DMA2_Channel3,
                .channel[3] = DMA2_Channel4,
                .channel[4] = DMA2_Channel5,
                .IRQn[0]    = DMA2_Channel1_IRQn,
                .IRQn[1]    = DMA2_Channel2_IRQn,
                .IRQn[2]    = DMA2_Channel3_IRQn,
                .IRQn[3]    = DMA2_Channel4_IRQn,
                .IRQn[4]    = DMA2_Channel5_IRQn,
        }
        #endif
};

static DMA_mem_t *DMA_mem;

/*==============================================================================
  Exported object
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device.
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 * @param[in ]            config               optional module configuration
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_INIT(DMA, void **device_handle, u8_t major, u8_t minor, const void *config)
{
        UNUSED_ARG1(config);

