devdnl/dnx-rtos/src/system/drivers/dma/drv/STM32F1F3/dma.c
        u32_t dmad    = 0;
        u8_t  channel = 0;

        for (; channel < DMA_HW[hdl->major].chcnt; channel++) {
                dmad = _DMA_DDI_reserve(hdl->major, channel + 1);
                if (dmad) break;
        }

        if (dmad && (hdl->m2m_queue[channel] == NULL)) {
                err = sys_queue_create(1, sizeof(int), &hdl->m2m_queue[channel]);
                if (err) {
                        _DMA_DDI_release(dmad);
                        return err;
                }
        }

        if (dmad) {
                u32_t PMSIZE, NDT;

                if (  ((size & 3) == 0)
                   && ((cast(u32_t, src) & 3) == 0)
                   && ((cast(u32_t, dst) & 3) == 0) ) {

                        PMSIZE = (2 << 10) | (2 << 8);

                        NDT = size / 4;

                } else if (  ((size & 1) == 0)
                          && ((cast(u32_t, src) & 1) == 0)
                          && ((cast(u32_t, dst) & 1) == 0) ) {

                        PMSIZE = (1 << 10) | (1 << 8);

                        NDT = size / 2;

                } else {
                        PMSIZE = 0;
                        NDT    = size;
                }

                if (NDT <= UINT16_MAX) {
                        _DMA_DDI_config_t config;
                        config.arg       = hdl->m2m_queue[channel];
                        config.cb_finish = M2M_callback;
                        config.cb_half   = NULL;
                        config.cb_next   = NULL;
                        config.release   = true;
                        config.PA        = cast(u32_t, src);
                        config.MA        = cast(u32_t, dst);
                        config.NDT       = NDT;
                        config.CR        = PMSIZE | DMA_CCR_MEM2MEM
                                         | DMA_CCR_MINC | DMA_CCR_PINC;
                        config.IRQ_priority = __CPU_DEFAULT_IRQ_PRIORITY__;

                        err = _DMA_DDI_transfer(dmad, &config);
                        if (!err) {
                                int ferr = EIO;
                                err = sys_queue_receive(hdl->m2m_queue[channel], &ferr,
                                                        M2M_TRANSFER_TIMEOUT);
                                if (!err) {
                                        err = ferr;
                                }
                        }
                } else {
                        err = EFBIG;
                }

                _DMA_DDI_release(dmad);
        }

        return err;
}


//==============================================================================
/**
 * @brief  Function clear flags for selected DMA and stream.
 *
 * @param  major        DMA number
 * @param  channel      stream number
 */
//==============================================================================
static void clear_DMA_IRQ_flags(u8_t major, u8_t channel)
{
        DMA_HW[major].DMA->IFCR = ( DMA_IFCR_CGIF1  | DMA_IFCR_CTCIF1
                                  | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1 )
                                  << (4 * channel);
}

//==============================================================================
/**
 * @brief  Memory to memory callback.
 *
 * @param  SR           status
 * @param  arg          argument
 *
 * @return True if yield needed, false otherwise.
 */
//==============================================================================
static bool M2M_callback(DMA_Channel_TypeDef *channel, u8_t SR, void *arg)
{
        UNUSED_ARG1(channel);

        bool yield = false;
        int  err   = (SR & DMA_SR_TCIF) ? ESUCC : EIO;

        sys_queue_send_from_ISR(arg, &err, &yield);

        return yield;
}

//==============================================================================
/**
 * @brief Function handle DMA IRQ.
 *
 * @param  major        DMA number
 * @param  channel      stream number
 */
//==============================================================================
static void IRQ_handle(u8_t major, u8_t channel)
{
        DMA_Channel_TypeDef *DMA_channel = DMA_HW[major].channel[channel];
        DMA_RT_channel_t    *RT_channel  = &DMA_mem->DMA[major].channel[channel];

        bool  yield = false;

        u32_t SR = DMA_HW[major].DMA->ISR >> (4 * channel);

        if ((DMA_channel->CCR & DMA_CCR_HTIE) && (SR & DMA_SR_HTIF)) {
                if (RT_channel->cb_half) {
                        yield = RT_channel->cb_half(DMA_channel, SR & 0xF, RT_channel->arg);
                }
        } else {
                if (RT_channel->cb_finish) {
                        yield = RT_channel->cb_finish(DMA_channel, SR & 0xF, RT_channel->arg);
                }
        }

        if (!(DMA_channel->CCR & DMA_CCR_CIRC)) {
                CLEAR_BIT(DMA_channel->CCR, DMA_CCR_EN);

                RT_channel->cb_half   = NULL;
                RT_channel->cb_finish = NULL;

                if (RT_channel->release) {
                        RT_channel->dmad    = 0;
                        RT_channel->release = false;
                }

                /*
                 * Writing EN bit to 0 is not immediately effective since it is
                 * actually written to 0 once all the current transfers have finished.
                 * When the EN bit is read as 0, this means that the stream is
                 * ready to be configured. It is therefore necessary to wait for
                 * the EN bit to be  cleared before starting any stream configuration.
                 */
                while (DMA_channel->CCR & DMA_CCR_EN);
        }

        clear_DMA_IRQ_flags(major, channel);

        if (RT_channel->cb_next) {
                yield |= RT_channel->cb_next(DMA_channel, SR & 0x3F,  RT_channel->arg);
        }

        sys_thread_yield_from_ISR(yield);
}

//==============================================================================
/**
 * @brief DMA1 Channel 1 IRQ.
 */
//==============================================================================
void DMA1_Channel1_IRQHandler(void)
{
        IRQ_handle(0, 0);
}

//==============================================================================
/**
 * @brief DMA1 Channel 2 IRQ.
 */
//==============================================================================
void DMA1_Channel2_IRQHandler(void)
{
        IRQ_handle(0, 1);
}

//==============================================================================
/**
 * @brief DMA1 Channel 3 IRQ.
 */
//==============================================================================
void DMA1_Channel3_IRQHandler(void)
{
        IRQ_handle(0, 2);
}

//==============================================================================
/**
 * @brief DMA1 Channel 4 IRQ.
 */
//==============================================================================
void DMA1_Channel4_IRQHandler(void)
{
        IRQ_handle(0, 3);
}

//==============================================================================
/**
 * @brief DMA1 Channel 5 IRQ.
 */
//==============================================================================
void DMA1_Channel5_IRQHandler(void)
{
        IRQ_handle(0, 4);
}

//==============================================================================
/**
 * @brief DMA1 Channel 6 IRQ.
 */
//==============================================================================
void DMA1_Channel6_IRQHandler(void)
{
        IRQ_handle(0, 5);
}

//==============================================================================
/**
 * @brief DMA1 Channel 7 IRQ.
 */
//==============================================================================
void DMA1_Channel7_IRQHandler(void)
{
        IRQ_handle(0, 6);
}

#if defined(RCC_AHBENR_DMA2EN)
//==============================================================================
/**
 * @brief DMA2 Channel 1 IRQ.
 */
//==============================================================================
void DMA2_Channel1_IRQHandler(void)
{
        IRQ_handle(1, 0);
}

//==============================================================================
/**
 * @brief DMA2 Channel 2 IRQ.
 */
//==============================================================================
void DMA2_Channel2_IRQHandler(void)
{
        IRQ_handle(1, 1);
}

//==============================================================================
/**
 * @brief DMA2 Channel 3 IRQ.
 */
//==============================================================================
void DMA2_Channel3_IRQHandler(void)
{
        IRQ_handle(1, 2);
}

//==============================================================================
/**
 * @brief DMA2 Channel 4 IRQ.
 */
//==============================================================================
void DMA2_Channel4_IRQHandler(void)
{
        IRQ_handle(1, 3);
}

//==============================================================================
/**
 * @brief DMA2 Channel 5 IRQ.
 */
//==============================================================================
void DMA2_Channel5_IRQHandler(void)
{
        IRQ_handle(1, 4);
}

//==============================================================================
/**
 * @brief DMA2 Channel 4 & 5 IRQ.
 */
//==============================================================================
void DMA2_Channel4_5_IRQHandler(void)
{
        if (DMA2->ISR & (DMA_ISR_GIF4 | DMA_ISR_TCIF4 | DMA_ISR_HTIF4 | DMA_ISR_TEIF4)) {
                IRQ_handle(1, 3);
        } else if (DMA2->ISR & (DMA_ISR_GIF5 | DMA_ISR_TCIF5 | DMA_ISR_HTIF5 | DMA_ISR_TEIF5)) {
                IRQ_handle(1, 4);
        } else {
                _assert(false);
        }
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
